In [13]:
#引入pandas
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

In [14]:
#删除制定轴上的项 drop方法返回的是一个在制定轴上删除了制定值得新对象
obj = Series(np.arange(5.),index = ['a','b','c','d','e'])
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [20]:
data = DataFrame(np.arange(16).reshape((4,4)),index = ['Ohio','Colorado','Utah','New York'],columns = ['one','two','three','four'])
# data.drop(['Colorado','Ohio'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
data.drop(['one','two'],axis = 1)

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

In [29]:
#索引、选取、过滤
#Series索引值不只是整数
obj = Series(np.arange(4.),index = ['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [30]:
obj['a']

0.0

In [34]:
#利用标签的切片和普通的切片是不一样的，其末端是包含的
obj['a':'b']

a    0.0
b    1.0
dtype: float64

In [35]:
data = DataFrame(np.arange(16).reshape((4,4)),index = ['Ohio','Colorado','Utah','New York'],columns = ['one','two','three','four'])

In [40]:
data[['two','three']]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [41]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [42]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [43]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [45]:
data[data<5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [46]:
data.ix['Colorado',['two','three']]

d:\users\阿苏\appdata\local\programs\python\python35-32\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

two      5
three    6
Name: Colorado, dtype: int32

In [47]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [49]:
data.ix[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [53]:
data.ix[data.three>5,:3]
#DataFrame的索引选项

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14